updates to slides about message excerpts
